<?php

namespace Database\Seeders;

use App\Models\Bot;
use Illuminate\Database\Seeder;

class BotsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $bots = [
            [
                'telegram_id' => 321022334,
                'user_id' => 1,
                'username' => 'uanews_uzhnu_bot',
                'name' => 'Бот Українських Новин',
                'about' => 'Привіт! Я Бот Українських новин 🗞️🤖 Моя мета - допомогти тобі бути в курсі найсвіжіших новин України та світу.',
                'description' => 'Привіт! Я - бот Українських новин. За допомогою цього бота ви зможете отримувати свіжі новини з різних джерел на українській мові. Для того, щоб почати користуватися ботом, достатньо його запустити та вибрати потрібний розділ з новинами. Бот пропонує кілька категорій новин, зокрема політичні новини, новини зі світу технологій, культури та спорту. Новини оновлюються автоматично, тому ви можете бути впевнені, що завжди будете в курсі останніх подій. Насолоджуйтеся користуванням ботом та будьте завжди в курсі!',
                'avatar' => 'https://telegra.ph/file/fa2c16733e7dc2bd446f8.jpg',
                'token' => '6071473354:AAH2Kk8fMXP00giah8JoQde-nkmxMzsd7n0',
                'is_active' => 1,
                'welcome_message_text' => "Привіт! Я Бот Українських новин 🗞️🤖 Моя мета - допомогти тобі бути в курсі найсвіжіших новин України та світу. Відтепер ти можеш отримувати оновлення в режимі реального часу, не відходячи від свого телефону! 😊 Для того, щоб підписатися на новини, просто напиши /subscribe. Якщо виникнуть питання, можеш написати /help.",
                'help_message_text' => "Привіт! Я - бот Українських новин 📰🤖

Якщо ти хочеш дізнатися останні новини з України та світу, просто відправ мені повідомлення і я надішлю тобі головні новини дня 📩

Крім того, я розумію такі команди:
/about - інформація про бота
/subscribe - підписатися на розсилку новин
/unsubscribe - відписатися від розсилки новин

Не соромся написати мені, я завжди радий спілкуванню з тобою! 💬",
                'created_at' => "2023-04-08 16:44:33",
                'updated_at' => "2023-04-08 16:47:42",
                'deleted_at' => null,
            ],
            [
                'telegram_id' => 32402231,
                'user_id' => 1,
                'username' => 'uzhnu_poster_bot',
                'name' => 'Uzhnu Autoposter',
                'about' => 'Автопостер',
                'description' => 'Тестовий автопостер',
                'avatar' => 'https://telegra.ph/file/722622534aa056f4caa5e.jpg',
                'token' => '6045908733:AAGgTuUmpnzKryQtQLss_5Qwu8Hzocr0RUg',
                'is_active' => 1,
                'welcome_message_text' => "Привіт! /start",
                'help_message_text' => "Привіт! /help",
                'created_at' => "2023-04-08 17:01:51",
                'updated_at' => "2023-04-08 17:01:51",
                'deleted_at' => null,
            ],
        ];
        Bot::query()->insert($bots);
    }
}
