<?php

namespace Database\Seeders;

use App\Models\Subreddit;
use Illuminate\Database\Seeder;

/**
 * Заповнюємо початковими даними субредіти.
 */
class SubredditsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $subreddits = [
            [
                'id' => 1,
                'name' => 'funny',
                'description' => 'це спільнота на Reddit, яка присвячена гумору та смішним відео, мемам, картинкам, історіям та іншим забавним контентом. Тут ви знайдете широкий спектр різноманітного контенту, що розповідає про життєві ситуації з гумором та іронією.',
                'created_at' => '2023-03-31 20:50:27',
                'updated_at' => '2023-03-31 20:50:27'
            ],
            [
                'id' => 2,
                'name' => 'Damnthatsinteresting',
                'description' => 'це спільнота на Reddit, яка призначена для людей, які люблять дізнаватися нове та цікаве про світ навколо нас. Тут можна знайти різноманітний контент, який стимулює думки та сприяє розширенню світогляду. Від останніх відкриттів в науці до унікальних історій з життя - все, що може викликати захоплення та зацікавленість.',
                'created_at' => '2023-03-31 20:52:30',
                'updated_at' => '2023-03-31 20:52:30'
            ],
            [
                'id' => 3,
                'name' => 'worldnews',
                'description' => 'це спільнота на Reddit, яка призначена для обговорення новин та подій, які відбуваються у світі. Тут зібрані новини з різних джерел, які стосуються політики, економіки, науки, технологій, культури та інших аспектів життя.',
                'created_at' => '2023-03-31 20:53:51',
                'updated_at' => '2023-03-31 20:53:51'
            ],
            [
                'id' => 4,
                'name' => 'ukraine',
                'description' => 'є місцем для обговорення різноманітних аспектів життя в Україні та української культури загалом. Учасники спільноти можуть ділитися новинами, фотографіями, відео та іншими матеріалами про Україну та українських народів, обговорювати політичну ситуацію, економіку, культуру, спорт, науку та технології, інші теми.',
                'created_at' => '2023-03-31 20:56:25',
                'updated_at' => '2023-03-31 20:56:25'
            ],
            [
                'id' => 5,
                'name' => 'gaming',
                'description' => 'Спільнота r/gaming на Reddit є однією з найбільших та найактивніших спільнот, присвячених відеоіграм. Учасники спільноти обговорюють різні аспекти світу відеоігор, такі як новини та огляди гри, геймплей, графіку, звукового оформлення, технічних проблем, майстерності та стратегії гри, а також культурні та соціальні впливи відеоігор.',
                'created_at' => '2023-03-31 20:19:31',
                'updated_at' => '2023-03-31 20:19:31'
            ]
        ];
        Subreddit::query()->insert($subreddits);
    }
}
